network-tests/v5/oha-results/istio-ambient/replica-4/test-productpage.bookinfo-basic.svc-128-30000.txt
Started at 2024-05-23-15-20
Summary:
  Success rate:	100.00%
  Total:	127.7161 secs
  Slowest:	0.9277 secs
  Fastest:	0.0657 secs
  Average:	0.5440 secs
  Requests/sec:	234.8959

  Total data:	141.75 MiB
  Size/request:	4.
  Size/sec:	1.11 MiB

Response time histogram:
  0.066 [1]     |
  0.152 [11]    |
  0.238 [12]    |
  0.324 [67]    |
  0.410 [113]   |
  0.497 [4023]  |■■■■■■
  0.583 [20156] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.669 [4863]  |■■■■■■■
  0.755 [646]   |■
  0.842 [86]    |
  0.928 [22]    |

Response time distribution:
  10.00% in 0.4893 secs
  25.00% in 0.5113 secs
  50.00% in 0.5374 secs
  75.00% in 0.5703 secs
  90.00% in 0.6109 secs
  95.00% in 0.6387 secs
  99.00% in 0.7075 secs
  99.90% in 0.8283 secs
  99.99% in 0.9183 secs


Details (average, fastest, slowest):
  DNS+dialup:	0.0003 secs, 0.0001 secs, 0.0612 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0037 secs

Status code distribution:
  [200] 30000 responses
Finished at 2024-05-23-15-22